# -*- coding: utf-8 -*-
"""
* Реализовать структуру данных «Товары».
Она должна представлять собой список кортежей.
Каждый кортеж хранит информацию об отдельном товаре.
В кортеже должно быть два элемента — номер товара и словарь с параметрами
(характеристиками товара: название, цена, количество, единица измерения).
Структуру нужно сформировать программно, т.е. запрашивать все данные у пользователя.
Пример готовой структуры:
[

(1, {“название”: “компьютер”, “цена”: 20000, “количество”: 5, “eд”: “шт.”}),
(2, {“название”: “принтер”, “цена”: 6000, “количество”: 2, “eд”: “шт.”}),
(3, {“название”: “сканер”, “цена”: 2000, “количество”: 7, “eд”: “шт.”})

]
Необходимо собрать аналитику о товарах.
Реализовать словарь, в котором каждый ключ — характеристика товара, например название,
а значение — список значений-характеристик, например список названий товаров.
Пример:
{

“название”: [“компьютер”, “принтер”, “сканер”],
“цена”: [20000, 6000, 2000],
“количество”: [5, 2, 7],
“ед”: [“шт.”]

}
"""
kol_iter = int(input('Введи количество наименований: '))
spisok = []

for i in range(kol_iter):
    print('===================')
    print(f'Введите описание {i + 1} товара')
    name_in = input('“название”:')
    price_in = input('“цена”:')
    quantity_in = input('“количество”:')
    unit_in = input('“ед”:')
    spisok.append(
        {
            'название': name_in,
            'цена': price_in,
            'количество': quantity_in,
            'ед': unit_in
        }
    )

name_out = list()
price_out = list()
quantity_out = list()
unit_out = list()

for j in range(kol_iter):
    name_out.append(spisok[j]['название'])
    price_out.append(spisok[j]['цена'])
    quantity_out.append(spisok[j]['количество'])
    unit_out.append(spisok[j]['ед'])


unit_set = list(set(unit_out))
print(f'“название”: {name_out},')
print(f'“цена”: {price_out},')
print(f'“количество”: {price_out},')
print(f'“ед”: {unit_set},')
